Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/silex.h
#define SILEX_DMA_PUSH_ADDR_LSB_PUSH_ADDR_LSB_Pos _UINT32_(0)                                          /* (SILEX_DMA_PUSH_ADDR_LSB)  Position */
#define SILEX_DMA_PUSH_ADDR_LSB_PUSH_ADDR_LSB_Msk (_UINT32_(0xFFFFFFFF) << SILEX_DMA_PUSH_ADDR_LSB_PUSH_ADDR_LSB_Pos) /* (SILEX_DMA_PUSH_ADDR_LSB)  Mask */
#define SILEX_DMA_PUSH_ADDR_LSB_PUSH_ADDR_LSB(value) (SILEX_DMA_PUSH_ADDR_LSB_PUSH_ADDR_LSB_Msk & (_UINT32_(value) << SILEX_DMA_PUSH_ADDR_LSB_PUSH_ADDR_LSB_Pos)) /* Assigment of value for PUSH_ADDR_LSB in the SILEX_DMA_PUSH_ADDR_LSB register */
#define SILEX_DMA_PUSH_ADDR_LSB_Msk           _UINT32_(0xFFFFFFFF)                                 /* (SILEX_DMA_PUSH_ADDR_LSB) Register Mask  */


/* -------- SILEX_DMA_PUSH_ADDR_MSB : (SILEX Offset: 0x14) (R/W 32)  -------- */
#define SILEX_DMA_PUSH_ADDR_MSB_RESETVALUE    _UINT32_(0x00)                                       /*  (SILEX_DMA_PUSH_ADDR_MSB)   Reset Value */

#define SILEX_DMA_PUSH_ADDR_MSB_PUSH_ADDR_MSB_Pos _UINT32_(0)                                          /* (SILEX_DMA_PUSH_ADDR_MSB)  Position */
#define SILEX_DMA_PUSH_ADDR_MSB_PUSH_ADDR_MSB_Msk (_UINT32_(0xFFFFFFFF) << SILEX_DMA_PUSH_ADDR_MSB_PUSH_ADDR_MSB_Pos) /* (SILEX_DMA_PUSH_ADDR_MSB)  Mask */
#define SILEX_DMA_PUSH_ADDR_MSB_PUSH_ADDR_MSB(value) (SILEX_DMA_PUSH_ADDR_MSB_PUSH_ADDR_MSB_Msk & (_UINT32_(value) << SILEX_DMA_PUSH_ADDR_MSB_PUSH_ADDR_MSB_Pos)) /* Assigment of value for PUSH_ADDR_MSB in the SILEX_DMA_PUSH_ADDR_MSB register */
#define SILEX_DMA_PUSH_ADDR_MSB_Msk           _UINT32_(0xFFFFFFFF)                                 /* (SILEX_DMA_PUSH_ADDR_MSB) Register Mask  */


/* -------- SILEX_DMA_PUSH_LEN : (SILEX Offset: 0x18) (R/W 32)  -------- */
#define SILEX_DMA_PUSH_LEN_RESETVALUE         _UINT32_(0x00)                                       /*  (SILEX_DMA_PUSH_LEN)   Reset Value */

#define SILEX_DMA_PUSH_LEN_PUSH_LEN_Pos       _UINT32_(0)                                          /* (SILEX_DMA_PUSH_LEN)  Position */
#define SILEX_DMA_PUSH_LEN_PUSH_LEN_Msk       (_UINT32_(0xFFFFFFF) << SILEX_DMA_PUSH_LEN_PUSH_LEN_Pos) /* (SILEX_DMA_PUSH_LEN)  Mask */
#define SILEX_DMA_PUSH_LEN_PUSH_LEN(value)    (SILEX_DMA_PUSH_LEN_PUSH_LEN_Msk & (_UINT32_(value) << SILEX_DMA_PUSH_LEN_PUSH_LEN_Pos)) /* Assigment of value for PUSH_LEN in the SILEX_DMA_PUSH_LEN register */
#define SILEX_DMA_PUSH_LEN_PUSH_CSTADDR_Pos   _UINT32_(28)                                         /* (SILEX_DMA_PUSH_LEN)  Position */
#define SILEX_DMA_PUSH_LEN_PUSH_CSTADDR_Msk   (_UINT32_(0x1) << SILEX_DMA_PUSH_LEN_PUSH_CSTADDR_Pos) /* (SILEX_DMA_PUSH_LEN)  Mask */
#define SILEX_DMA_PUSH_LEN_PUSH_CSTADDR(value) (SILEX_DMA_PUSH_LEN_PUSH_CSTADDR_Msk & (_UINT32_(value) << SILEX_DMA_PUSH_LEN_PUSH_CSTADDR_Pos)) /* Assigment of value for PUSH_CSTADDR in the SILEX_DMA_PUSH_LEN register */
#define SILEX_DMA_PUSH_LEN_PUSH_REALIGN_Pos   _UINT32_(29)                                         /* (SILEX_DMA_PUSH_LEN)  Position */
#define SILEX_DMA_PUSH_LEN_PUSH_REALIGN_Msk   (_UINT32_(0x1) << SILEX_DMA_PUSH_LEN_PUSH_REALIGN_Pos) /* (SILEX_DMA_PUSH_LEN)  Mask */
#define SILEX_DMA_PUSH_LEN_PUSH_REALIGN(value) (SILEX_DMA_PUSH_LEN_PUSH_REALIGN_Msk & (_UINT32_(value) << SILEX_DMA_PUSH_LEN_PUSH_REALIGN_Pos)) /* Assigment of value for PUSH_REALIGN in the SILEX_DMA_PUSH_LEN register */
#define SILEX_DMA_PUSH_LEN_PUSH_DISCARD_Pos   _UINT32_(30)                                         /* (SILEX_DMA_PUSH_LEN)  Position */
#define SILEX_DMA_PUSH_LEN_PUSH_DISCARD_Msk   (_UINT32_(0x1) << SILEX_DMA_PUSH_LEN_PUSH_DISCARD_Pos) /* (SILEX_DMA_PUSH_LEN)  Mask */
#define SILEX_DMA_PUSH_LEN_PUSH_DISCARD(value) (SILEX_DMA_PUSH_LEN_PUSH_DISCARD_Msk & (_UINT32_(value) << SILEX_DMA_PUSH_LEN_PUSH_DISCARD_Pos)) /* Assigment of value for PUSH_DISCARD in the SILEX_DMA_PUSH_LEN register */
#define SILEX_DMA_PUSH_LEN_Msk                _UINT32_(0x7FFFFFFF)                                 /* (SILEX_DMA_PUSH_LEN) Register Mask  */


/* -------- SILEX_DMA_INT_EN : (SILEX Offset: 0x1C) (R/W 32)  -------- */
#define SILEX_DMA_INT_EN_RESETVALUE           _UINT32_(0x00)                                       /*  (SILEX_DMA_INT_EN)   Reset Value */

#define SILEX_DMA_INT_EN_INT_EN_Pos           _UINT32_(0)                                          /* (SILEX_DMA_INT_EN)  Position */
#define SILEX_DMA_INT_EN_INT_EN_Msk           (_UINT32_(0xFFFFFFFF) << SILEX_DMA_INT_EN_INT_EN_Pos) /* (SILEX_DMA_INT_EN)  Mask */
#define SILEX_DMA_INT_EN_INT_EN(value)        (SILEX_DMA_INT_EN_INT_EN_Msk & (_UINT32_(value) << SILEX_DMA_INT_EN_INT_EN_Pos)) /* Assigment of value for INT_EN in the SILEX_DMA_INT_EN register */
#define SILEX_DMA_INT_EN_Msk                  _UINT32_(0xFFFFFFFF)                                 /* (SILEX_DMA_INT_EN) Register Mask  */


/* -------- SILEX_DMA_INT_ENSET : (SILEX Offset: 0x20) ( /W 32)  -------- */
#define SILEX_DMA_INT_ENSET_RESETVALUE        _UINT32_(0x00)                                       /*  (SILEX_DMA_INT_ENSET)   Reset Value */

#define SILEX_DMA_INT_ENSET_INT_ENSET_Pos     _UINT32_(0)                                          /* (SILEX_DMA_INT_ENSET)  Position */
#define SILEX_DMA_INT_ENSET_INT_ENSET_Msk     (_UINT32_(0xFFFFFFFF) << SILEX_DMA_INT_ENSET_INT_ENSET_Pos) /* (SILEX_DMA_INT_ENSET)  Mask */
#define SILEX_DMA_INT_ENSET_INT_ENSET(value)  (SILEX_DMA_INT_ENSET_INT_ENSET_Msk & (_UINT32_(value) << SILEX_DMA_INT_ENSET_INT_ENSET_Pos)) /* Assigment of value for INT_ENSET in the SILEX_DMA_INT_ENSET register */
#define SILEX_DMA_INT_ENSET_Msk               _UINT32_(0xFFFFFFFF)                                 /* (SILEX_DMA_INT_ENSET) Register Mask  */


/* -------- SILEX_DMA_INT_ENCLR : (SILEX Offset: 0x24) ( /W 32)  -------- */
#define SILEX_DMA_INT_ENCLR_RESETVALUE        _UINT32_(0x00)                                       /*  (SILEX_DMA_INT_ENCLR)   Reset Value */

#define SILEX_DMA_INT_ENCLR_INT_ENCLR_Pos     _UINT32_(0)                                          /* (SILEX_DMA_INT_ENCLR)  Position */
#define SILEX_DMA_INT_ENCLR_INT_ENCLR_Msk     (_UINT32_(0xFFFFFFFF) << SILEX_DMA_INT_ENCLR_INT_ENCLR_Pos) /* (SILEX_DMA_INT_ENCLR)  Mask */
#define SILEX_DMA_INT_ENCLR_INT_ENCLR(value)  (SILEX_DMA_INT_ENCLR_INT_ENCLR_Msk & (_UINT32_(value) << SILEX_DMA_INT_ENCLR_INT_ENCLR_Pos)) /* Assigment of value for INT_ENCLR in the SILEX_DMA_INT_ENCLR register */
#define SILEX_DMA_INT_ENCLR_Msk               _UINT32_(0xFFFFFFFF)                                 /* (SILEX_DMA_INT_ENCLR) Register Mask  */


