Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/silex.h
/* -------- SILEX_RNG_CONTROL_PROPTHRESHOLD : (SILEX Offset: 0x1028) (R/W 32) Adaptive Proportion Test (1024-sample window) Cut-Off value. -------- */
#define SILEX_RNG_CONTROL_PROPTHRESHOLD_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_RNG_CONTROL_PROPTHRESHOLD) Adaptive Proportion Test (1024-sample window) Cut-Off value.  Reset Value */

#define SILEX_RNG_CONTROL_PROPTHRESHOLD_PROPTHRESHOLD_Pos _UINT32_(0)                                          /* (SILEX_RNG_CONTROL_PROPTHRESHOLD) Adaptive Proportion Test (1024-sample window) Cut-Off value. Position */
#define SILEX_RNG_CONTROL_PROPTHRESHOLD_PROPTHRESHOLD_Msk (_UINT32_(0xFFFFFFFF) << SILEX_RNG_CONTROL_PROPTHRESHOLD_PROPTHRESHOLD_Pos) /* (SILEX_RNG_CONTROL_PROPTHRESHOLD) Adaptive Proportion Test (1024-sample window) Cut-Off value. Mask */
#define SILEX_RNG_CONTROL_PROPTHRESHOLD_PROPTHRESHOLD(value) (SILEX_RNG_CONTROL_PROPTHRESHOLD_PROPTHRESHOLD_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_PROPTHRESHOLD_PROPTHRESHOLD_Pos)) /* Assigment of value for PROPTHRESHOLD in the SILEX_RNG_CONTROL_PROPTHRESHOLD register */
#define SILEX_RNG_CONTROL_PROPTHRESHOLD_Msk   _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_CONTROL_PROPTHRESHOLD) Register Mask  */


/* -------- SILEX_RNG_CONTROL_STATUS : (SILEX Offset: 0x1030) (R/W 32) Status register. -------- */
#define SILEX_RNG_CONTROL_STATUS_RESETVALUE   _UINT32_(0x00)                                       /*  (SILEX_RNG_CONTROL_STATUS) Status register.  Reset Value */

#define SILEX_RNG_CONTROL_STATUS_TESTDATABUSY_Pos _UINT32_(0)                                          /* (SILEX_RNG_CONTROL_STATUS) High when data written to TestData register is being processed. (see section 4.7) Position */
#define SILEX_RNG_CONTROL_STATUS_TESTDATABUSY_Msk (_UINT32_(0x1) << SILEX_RNG_CONTROL_STATUS_TESTDATABUSY_Pos) /* (SILEX_RNG_CONTROL_STATUS) High when data written to TestData register is being processed. (see section 4.7) Mask */
#define SILEX_RNG_CONTROL_STATUS_TESTDATABUSY(value) (SILEX_RNG_CONTROL_STATUS_TESTDATABUSY_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_STATUS_TESTDATABUSY_Pos)) /* Assigment of value for TESTDATABUSY in the SILEX_RNG_CONTROL_STATUS register */
#define SILEX_RNG_CONTROL_STATUS_STATE_Pos    _UINT32_(1)                                          /* (SILEX_RNG_CONTROL_STATUS) State of the control FSM: 000: Reset, 001: Startup, 010: Idle (Rings On), 011: Idle (Rings Off), 100: Fill FIFO, 101: Error, 110: Unused, 111: Unused. Position */
#define SILEX_RNG_CONTROL_STATUS_STATE_Msk    (_UINT32_(0x7) << SILEX_RNG_CONTROL_STATUS_STATE_Pos) /* (SILEX_RNG_CONTROL_STATUS) State of the control FSM: 000: Reset, 001: Startup, 010: Idle (Rings On), 011: Idle (Rings Off), 100: Fill FIFO, 101: Error, 110: Unused, 111: Unused. Mask */
#define SILEX_RNG_CONTROL_STATUS_STATE(value) (SILEX_RNG_CONTROL_STATUS_STATE_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_STATUS_STATE_Pos)) /* Assigment of value for STATE in the SILEX_RNG_CONTROL_STATUS register */
#define SILEX_RNG_CONTROL_STATUS_REPFAIL_Pos  _UINT32_(4)                                          /* (SILEX_RNG_CONTROL_STATUS) NIST-800-90B repetition Count Test interrupt status. Position */
#define SILEX_RNG_CONTROL_STATUS_REPFAIL_Msk  (_UINT32_(0x1) << SILEX_RNG_CONTROL_STATUS_REPFAIL_Pos) /* (SILEX_RNG_CONTROL_STATUS) NIST-800-90B repetition Count Test interrupt status. Mask */
#define SILEX_RNG_CONTROL_STATUS_REPFAIL(value) (SILEX_RNG_CONTROL_STATUS_REPFAIL_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_STATUS_REPFAIL_Pos)) /* Assigment of value for REPFAIL in the SILEX_RNG_CONTROL_STATUS register */
#define SILEX_RNG_CONTROL_STATUS_PROPFAIL_Pos _UINT32_(5)                                          /* (SILEX_RNG_CONTROL_STATUS) NIST-800-90B adaptive Proportion Test (1024-sample window) interrupt status. Position */
#define SILEX_RNG_CONTROL_STATUS_PROPFAIL_Msk (_UINT32_(0x1) << SILEX_RNG_CONTROL_STATUS_PROPFAIL_Pos) /* (SILEX_RNG_CONTROL_STATUS) NIST-800-90B adaptive Proportion Test (1024-sample window) interrupt status. Mask */
#define SILEX_RNG_CONTROL_STATUS_PROPFAIL(value) (SILEX_RNG_CONTROL_STATUS_PROPFAIL_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_STATUS_PROPFAIL_Pos)) /* Assigment of value for PROPFAIL in the SILEX_RNG_CONTROL_STATUS register */
#define SILEX_RNG_CONTROL_STATUS_FULLINT_Pos  _UINT32_(7)                                          /* (SILEX_RNG_CONTROL_STATUS) FIFO full status. Position */
#define SILEX_RNG_CONTROL_STATUS_FULLINT_Msk  (_UINT32_(0x1) << SILEX_RNG_CONTROL_STATUS_FULLINT_Pos) /* (SILEX_RNG_CONTROL_STATUS) FIFO full status. Mask */
#define SILEX_RNG_CONTROL_STATUS_FULLINT(value) (SILEX_RNG_CONTROL_STATUS_FULLINT_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_STATUS_FULLINT_Pos)) /* Assigment of value for FULLINT in the SILEX_RNG_CONTROL_STATUS register */
#define SILEX_RNG_CONTROL_STATUS_PREINT_Pos   _UINT32_(8)                                          /* (SILEX_RNG_CONTROL_STATUS) AIS31 preliminary noise alarm interrupt status. Position */
#define SILEX_RNG_CONTROL_STATUS_PREINT_Msk   (_UINT32_(0x1) << SILEX_RNG_CONTROL_STATUS_PREINT_Pos) /* (SILEX_RNG_CONTROL_STATUS) AIS31 preliminary noise alarm interrupt status. Mask */
#define SILEX_RNG_CONTROL_STATUS_PREINT(value) (SILEX_RNG_CONTROL_STATUS_PREINT_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_STATUS_PREINT_Pos)) /* Assigment of value for PREINT in the SILEX_RNG_CONTROL_STATUS register */
#define SILEX_RNG_CONTROL_STATUS_ALMINT_Pos   _UINT32_(9)                                          /* (SILEX_RNG_CONTROL_STATUS) AIS31 noise alarm interrupt status. Position */
#define SILEX_RNG_CONTROL_STATUS_ALMINT_Msk   (_UINT32_(0x1) << SILEX_RNG_CONTROL_STATUS_ALMINT_Pos) /* (SILEX_RNG_CONTROL_STATUS) AIS31 noise alarm interrupt status. Mask */
#define SILEX_RNG_CONTROL_STATUS_ALMINT(value) (SILEX_RNG_CONTROL_STATUS_ALMINT_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_STATUS_ALMINT_Pos)) /* Assigment of value for ALMINT in the SILEX_RNG_CONTROL_STATUS register */
#define SILEX_RNG_CONTROL_STATUS_STARTUPFAIL_Pos _UINT32_(10)                                         /* (SILEX_RNG_CONTROL_STATUS) Start-up test failure. Position */
#define SILEX_RNG_CONTROL_STATUS_STARTUPFAIL_Msk (_UINT32_(0x1) << SILEX_RNG_CONTROL_STATUS_STARTUPFAIL_Pos) /* (SILEX_RNG_CONTROL_STATUS) Start-up test failure. Mask */
#define SILEX_RNG_CONTROL_STATUS_STARTUPFAIL(value) (SILEX_RNG_CONTROL_STATUS_STARTUPFAIL_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_STATUS_STARTUPFAIL_Pos)) /* Assigment of value for STARTUPFAIL in the SILEX_RNG_CONTROL_STATUS register */
#define SILEX_RNG_CONTROL_STATUS_FIFOACCFAIL_Pos _UINT32_(11)                                         /* (SILEX_RNG_CONTROL_STATUS) Set when a FIFO data read is performed while the NDRNG is disabled AND has its FIFO empty (FIFOLevel = 0). Position */
#define SILEX_RNG_CONTROL_STATUS_FIFOACCFAIL_Msk (_UINT32_(0x1) << SILEX_RNG_CONTROL_STATUS_FIFOACCFAIL_Pos) /* (SILEX_RNG_CONTROL_STATUS) Set when a FIFO data read is performed while the NDRNG is disabled AND has its FIFO empty (FIFOLevel = 0). Mask */
#define SILEX_RNG_CONTROL_STATUS_FIFOACCFAIL(value) (SILEX_RNG_CONTROL_STATUS_FIFOACCFAIL_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_STATUS_FIFOACCFAIL_Pos)) /* Assigment of value for FIFOACCFAIL in the SILEX_RNG_CONTROL_STATUS register */
#define SILEX_RNG_CONTROL_STATUS_Msk          _UINT32_(0x00000FBF)                                 /* (SILEX_RNG_CONTROL_STATUS) Register Mask  */


/* -------- SILEX_RNG_CONTROL_INITWAITVAL : (SILEX Offset: 0x1034) (R/W 32) Initial wait counter value. -------- */
#define SILEX_RNG_CONTROL_INITWAITVAL_RESETVALUE _UINT32_(0xFFFF)                                     /*  (SILEX_RNG_CONTROL_INITWAITVAL) Initial wait counter value.  Reset Value */

#define SILEX_RNG_CONTROL_INITWAITVAL_INITWAITVAL_Pos _UINT32_(0)                                          /* (SILEX_RNG_CONTROL_INITWAITVAL) Number of clock cycles to wait before sampling data from the noise source. Position */
#define SILEX_RNG_CONTROL_INITWAITVAL_INITWAITVAL_Msk (_UINT32_(0xFFFF) << SILEX_RNG_CONTROL_INITWAITVAL_INITWAITVAL_Pos) /* (SILEX_RNG_CONTROL_INITWAITVAL) Number of clock cycles to wait before sampling data from the noise source. Mask */
#define SILEX_RNG_CONTROL_INITWAITVAL_INITWAITVAL(value) (SILEX_RNG_CONTROL_INITWAITVAL_INITWAITVAL_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_INITWAITVAL_INITWAITVAL_Pos)) /* Assigment of value for INITWAITVAL in the SILEX_RNG_CONTROL_INITWAITVAL register */
#define SILEX_RNG_CONTROL_INITWAITVAL_Msk     _UINT32_(0x0000FFFF)                                 /* (SILEX_RNG_CONTROL_INITWAITVAL) Register Mask  */


/* -------- SILEX_RNG_CONTROL_DISABLEOSC0 : (SILEX Offset: 0x1038) (R/W 32) Disable oscillator rings #0 to #31. -------- */
#define SILEX_RNG_CONTROL_DISABLEOSC0_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_RNG_CONTROL_DISABLEOSC0) Disable oscillator rings #0 to #31.  Reset Value */

