Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/silex.h
#define SILEX_RNG_CONTROL_DISABLEOSC0_DISABLEOSC0_Pos _UINT32_(0)                                          /* (SILEX_RNG_CONTROL_DISABLEOSC0) Disable oscillator rings #0 to #31. Position */
#define SILEX_RNG_CONTROL_DISABLEOSC0_DISABLEOSC0_Msk (_UINT32_(0xFFFFFFFF) << SILEX_RNG_CONTROL_DISABLEOSC0_DISABLEOSC0_Pos) /* (SILEX_RNG_CONTROL_DISABLEOSC0) Disable oscillator rings #0 to #31. Mask */
#define SILEX_RNG_CONTROL_DISABLEOSC0_DISABLEOSC0(value) (SILEX_RNG_CONTROL_DISABLEOSC0_DISABLEOSC0_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_DISABLEOSC0_DISABLEOSC0_Pos)) /* Assigment of value for DISABLEOSC0 in the SILEX_RNG_CONTROL_DISABLEOSC0 register */
#define SILEX_RNG_CONTROL_DISABLEOSC0_Msk     _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_CONTROL_DISABLEOSC0) Register Mask  */


/* -------- SILEX_RNG_CONTROL_DISABLEOSC1 : (SILEX Offset: 0x103C) (R/W 32) Disable oscillator rings #32 to #63. -------- */
#define SILEX_RNG_CONTROL_DISABLEOSC1_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_RNG_CONTROL_DISABLEOSC1) Disable oscillator rings #32 to #63.  Reset Value */

#define SILEX_RNG_CONTROL_DISABLEOSC1_DISABLEOSC1_Pos _UINT32_(0)                                          /* (SILEX_RNG_CONTROL_DISABLEOSC1) Disable oscillator rings #32 to #63. Position */
#define SILEX_RNG_CONTROL_DISABLEOSC1_DISABLEOSC1_Msk (_UINT32_(0xFFFFFFFF) << SILEX_RNG_CONTROL_DISABLEOSC1_DISABLEOSC1_Pos) /* (SILEX_RNG_CONTROL_DISABLEOSC1) Disable oscillator rings #32 to #63. Mask */
#define SILEX_RNG_CONTROL_DISABLEOSC1_DISABLEOSC1(value) (SILEX_RNG_CONTROL_DISABLEOSC1_DISABLEOSC1_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_DISABLEOSC1_DISABLEOSC1_Pos)) /* Assigment of value for DISABLEOSC1 in the SILEX_RNG_CONTROL_DISABLEOSC1 register */
#define SILEX_RNG_CONTROL_DISABLEOSC1_Msk     _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_CONTROL_DISABLEOSC1) Register Mask  */


/* -------- SILEX_RNG_CONTROL_SWOFFTMRVAL : (SILEX Offset: 0x1040) (R/W 32) Switch off timer value. -------- */
#define SILEX_RNG_CONTROL_SWOFFTMRVAL_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_RNG_CONTROL_SWOFFTMRVAL) Switch off timer value.  Reset Value */

#define SILEX_RNG_CONTROL_SWOFFTMRVAL_SWOFFTMRVAL_Pos _UINT32_(0)                                          /* (SILEX_RNG_CONTROL_SWOFFTMRVAL) Number of clk cycles to wait before stopping the rings after the FIFO is full. Position */
#define SILEX_RNG_CONTROL_SWOFFTMRVAL_SWOFFTMRVAL_Msk (_UINT32_(0xFFFF) << SILEX_RNG_CONTROL_SWOFFTMRVAL_SWOFFTMRVAL_Pos) /* (SILEX_RNG_CONTROL_SWOFFTMRVAL) Number of clk cycles to wait before stopping the rings after the FIFO is full. Mask */
#define SILEX_RNG_CONTROL_SWOFFTMRVAL_SWOFFTMRVAL(value) (SILEX_RNG_CONTROL_SWOFFTMRVAL_SWOFFTMRVAL_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_SWOFFTMRVAL_SWOFFTMRVAL_Pos)) /* Assigment of value for SWOFFTMRVAL in the SILEX_RNG_CONTROL_SWOFFTMRVAL register */
#define SILEX_RNG_CONTROL_SWOFFTMRVAL_Msk     _UINT32_(0x0000FFFF)                                 /* (SILEX_RNG_CONTROL_SWOFFTMRVAL) Register Mask  */


/* -------- SILEX_RNG_CONTROL_CLKDIV : (SILEX Offset: 0x1044) (R/W 32) Sample clock divider. -------- */
#define SILEX_RNG_CONTROL_CLKDIV_RESETVALUE   _UINT32_(0x00)                                       /*  (SILEX_RNG_CONTROL_CLKDIV) Sample clock divider.  Reset Value */

#define SILEX_RNG_CONTROL_CLKDIV_CLKDIV_Pos   _UINT32_(0)                                          /* (SILEX_RNG_CONTROL_CLKDIV) Sample clock divider. The frequency at which the outputs of the rings are sampled is given by: Fs=Fpclk/(ClkDiv+1). Position */
#define SILEX_RNG_CONTROL_CLKDIV_CLKDIV_Msk   (_UINT32_(0xFF) << SILEX_RNG_CONTROL_CLKDIV_CLKDIV_Pos) /* (SILEX_RNG_CONTROL_CLKDIV) Sample clock divider. The frequency at which the outputs of the rings are sampled is given by: Fs=Fpclk/(ClkDiv+1). Mask */
#define SILEX_RNG_CONTROL_CLKDIV_CLKDIV(value) (SILEX_RNG_CONTROL_CLKDIV_CLKDIV_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_CLKDIV_CLKDIV_Pos)) /* Assigment of value for CLKDIV in the SILEX_RNG_CONTROL_CLKDIV register */
#define SILEX_RNG_CONTROL_CLKDIV_Msk          _UINT32_(0x000000FF)                                 /* (SILEX_RNG_CONTROL_CLKDIV) Register Mask  */


/* -------- SILEX_RNG_CONTROL_AIS31CONF0 : (SILEX Offset: 0x1048) (R/W 32) AIS31 configuration register 0. -------- */
#define SILEX_RNG_CONTROL_AIS31CONF0_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_RNG_CONTROL_AIS31CONF0) AIS31 configuration register 0.  Reset Value */

#define SILEX_RNG_CONTROL_AIS31CONF0_STARTUPTHRESHOLD_Pos _UINT32_(0)                                          /* (SILEX_RNG_CONTROL_AIS31CONF0) Start-up test threshold. Position */
#define SILEX_RNG_CONTROL_AIS31CONF0_STARTUPTHRESHOLD_Msk (_UINT32_(0xFFFF) << SILEX_RNG_CONTROL_AIS31CONF0_STARTUPTHRESHOLD_Pos) /* (SILEX_RNG_CONTROL_AIS31CONF0) Start-up test threshold. Mask */
#define SILEX_RNG_CONTROL_AIS31CONF0_STARTUPTHRESHOLD(value) (SILEX_RNG_CONTROL_AIS31CONF0_STARTUPTHRESHOLD_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_AIS31CONF0_STARTUPTHRESHOLD_Pos)) /* Assigment of value for STARTUPTHRESHOLD in the SILEX_RNG_CONTROL_AIS31CONF0 register */
#define SILEX_RNG_CONTROL_AIS31CONF0_ONLINETHRESHOLD_Pos _UINT32_(16)                                         /* (SILEX_RNG_CONTROL_AIS31CONF0) Online threshold. Position */
#define SILEX_RNG_CONTROL_AIS31CONF0_ONLINETHRESHOLD_Msk (_UINT32_(0xFFFF) << SILEX_RNG_CONTROL_AIS31CONF0_ONLINETHRESHOLD_Pos) /* (SILEX_RNG_CONTROL_AIS31CONF0) Online threshold. Mask */
#define SILEX_RNG_CONTROL_AIS31CONF0_ONLINETHRESHOLD(value) (SILEX_RNG_CONTROL_AIS31CONF0_ONLINETHRESHOLD_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_AIS31CONF0_ONLINETHRESHOLD_Pos)) /* Assigment of value for ONLINETHRESHOLD in the SILEX_RNG_CONTROL_AIS31CONF0 register */
#define SILEX_RNG_CONTROL_AIS31CONF0_Msk      _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_CONTROL_AIS31CONF0) Register Mask  */


/* -------- SILEX_RNG_CONTROL_AIS31CONF1 : (SILEX Offset: 0x104C) (R/W 32) AIS31 configuration register 1. -------- */
#define SILEX_RNG_CONTROL_AIS31CONF1_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_RNG_CONTROL_AIS31CONF1) AIS31 configuration register 1.  Reset Value */

#define SILEX_RNG_CONTROL_AIS31CONF1_ONLINEREPTHRESHOLD_Pos _UINT32_(0)                                          /* (SILEX_RNG_CONTROL_AIS31CONF1) Online repeat threshold. Position */
#define SILEX_RNG_CONTROL_AIS31CONF1_ONLINEREPTHRESHOLD_Msk (_UINT32_(0xFFFF) << SILEX_RNG_CONTROL_AIS31CONF1_ONLINEREPTHRESHOLD_Pos) /* (SILEX_RNG_CONTROL_AIS31CONF1) Online repeat threshold. Mask */
#define SILEX_RNG_CONTROL_AIS31CONF1_ONLINEREPTHRESHOLD(value) (SILEX_RNG_CONTROL_AIS31CONF1_ONLINEREPTHRESHOLD_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_AIS31CONF1_ONLINEREPTHRESHOLD_Pos)) /* Assigment of value for ONLINEREPTHRESHOLD in the SILEX_RNG_CONTROL_AIS31CONF1 register */
#define SILEX_RNG_CONTROL_AIS31CONF1_HEXPECTEDVALUE_Pos _UINT32_(16)                                         /* (SILEX_RNG_CONTROL_AIS31CONF1) Expected history value. Position */
#define SILEX_RNG_CONTROL_AIS31CONF1_HEXPECTEDVALUE_Msk (_UINT32_(0xFFFF) << SILEX_RNG_CONTROL_AIS31CONF1_HEXPECTEDVALUE_Pos) /* (SILEX_RNG_CONTROL_AIS31CONF1) Expected history value. Mask */
#define SILEX_RNG_CONTROL_AIS31CONF1_HEXPECTEDVALUE(value) (SILEX_RNG_CONTROL_AIS31CONF1_HEXPECTEDVALUE_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_AIS31CONF1_HEXPECTEDVALUE_Pos)) /* Assigment of value for HEXPECTEDVALUE in the SILEX_RNG_CONTROL_AIS31CONF1 register */
#define SILEX_RNG_CONTROL_AIS31CONF1_Msk      _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_CONTROL_AIS31CONF1) Register Mask  */


