Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/silex.h
#define SILEX_PK_CONTROL_START_Pos            _UINT32_(0)                                          /* (SILEX_PK_CONTROL) Writing a '1' starts the processing. Position */
#define SILEX_PK_CONTROL_START_Msk            (_UINT32_(0x1) << SILEX_PK_CONTROL_START_Pos)        /* (SILEX_PK_CONTROL) Writing a '1' starts the processing. Mask */
#define SILEX_PK_CONTROL_START(value)         (SILEX_PK_CONTROL_START_Msk & (_UINT32_(value) << SILEX_PK_CONTROL_START_Pos)) /* Assigment of value for START in the SILEX_PK_CONTROL register */
#define SILEX_PK_CONTROL_CLEARIRQ_Pos         _UINT32_(1)                                          /* (SILEX_PK_CONTROL) Writing a '1' clears the IRQ output. Position */
#define SILEX_PK_CONTROL_CLEARIRQ_Msk         (_UINT32_(0x1) << SILEX_PK_CONTROL_CLEARIRQ_Pos)     /* (SILEX_PK_CONTROL) Writing a '1' clears the IRQ output. Mask */
#define SILEX_PK_CONTROL_CLEARIRQ(value)      (SILEX_PK_CONTROL_CLEARIRQ_Msk & (_UINT32_(value) << SILEX_PK_CONTROL_CLEARIRQ_Pos)) /* Assigment of value for CLEARIRQ in the SILEX_PK_CONTROL register */
#define SILEX_PK_CONTROL_Msk                  _UINT32_(0x00000003)                                 /* (SILEX_PK_CONTROL) Register Mask  */


/* -------- SILEX_PK_STATUS : (SILEX Offset: 0x200C) ( R/ 32) Status register. -------- */
#define SILEX_PK_STATUS_RESETVALUE            _UINT32_(0x00)                                       /*  (SILEX_PK_STATUS) Status register.  Reset Value */

#define SILEX_PK_STATUS_ERRORFLAGS_Pos        _UINT32_(4)                                          /* (SILEX_PK_STATUS) These bits indicate an error condition. They are updated at the end of the operation. They are cleared when starting a new operation. See documentation for more details. Position */
#define SILEX_PK_STATUS_ERRORFLAGS_Msk        (_UINT32_(0xFFF) << SILEX_PK_STATUS_ERRORFLAGS_Pos)  /* (SILEX_PK_STATUS) These bits indicate an error condition. They are updated at the end of the operation. They are cleared when starting a new operation. See documentation for more details. Mask */
#define SILEX_PK_STATUS_ERRORFLAGS(value)     (SILEX_PK_STATUS_ERRORFLAGS_Msk & (_UINT32_(value) << SILEX_PK_STATUS_ERRORFLAGS_Pos)) /* Assigment of value for ERRORFLAGS in the SILEX_PK_STATUS register */
#define SILEX_PK_STATUS_PK_BUSY_Pos           _UINT32_(16)                                         /* (SILEX_PK_STATUS) This bit reflects the BUSY output value. It is set when the operation starts and it is cleared when the operation is finished. Position */
#define SILEX_PK_STATUS_PK_BUSY_Msk           (_UINT32_(0x1) << SILEX_PK_STATUS_PK_BUSY_Pos)       /* (SILEX_PK_STATUS) This bit reflects the BUSY output value. It is set when the operation starts and it is cleared when the operation is finished. Mask */
#define SILEX_PK_STATUS_PK_BUSY(value)        (SILEX_PK_STATUS_PK_BUSY_Msk & (_UINT32_(value) << SILEX_PK_STATUS_PK_BUSY_Pos)) /* Assigment of value for PK_BUSY in the SILEX_PK_STATUS register */
#define SILEX_PK_STATUS_INTRPTSTATUS_Pos      _UINT32_(17)                                         /* (SILEX_PK_STATUS) This bit reflects the IRQ output value. It is set when the operation is finished. It is cleared when the CPU writes the bit 1 of Control Register. Position */
#define SILEX_PK_STATUS_INTRPTSTATUS_Msk      (_UINT32_(0x1) << SILEX_PK_STATUS_INTRPTSTATUS_Pos)  /* (SILEX_PK_STATUS) This bit reflects the IRQ output value. It is set when the operation is finished. It is cleared when the CPU writes the bit 1 of Control Register. Mask */
#define SILEX_PK_STATUS_INTRPTSTATUS(value)   (SILEX_PK_STATUS_INTRPTSTATUS_Msk & (_UINT32_(value) << SILEX_PK_STATUS_INTRPTSTATUS_Pos)) /* Assigment of value for INTRPTSTATUS in the SILEX_PK_STATUS register */
#define SILEX_PK_STATUS_FAILPTR_Pos           _UINT32_(24)                                         /* (SILEX_PK_STATUS) These bits indicate which data location generated the error flag. They are not available for all error flags. Position */
#define SILEX_PK_STATUS_FAILPTR_Msk           (_UINT32_(0x1F) << SILEX_PK_STATUS_FAILPTR_Pos)      /* (SILEX_PK_STATUS) These bits indicate which data location generated the error flag. They are not available for all error flags. Mask */
#define SILEX_PK_STATUS_FAILPTR(value)        (SILEX_PK_STATUS_FAILPTR_Msk & (_UINT32_(value) << SILEX_PK_STATUS_FAILPTR_Pos)) /* Assigment of value for FAILPTR in the SILEX_PK_STATUS register */
#define SILEX_PK_STATUS_Msk                   _UINT32_(0x1F03FFF0)                                 /* (SILEX_PK_STATUS) Register Mask  */


/* -------- SILEX_PK_TIMER : (SILEX Offset: 0x2014) (R/W 32) Timer register. -------- */
#define SILEX_PK_TIMER_RESETVALUE             _UINT32_(0x00)                                       /*  (SILEX_PK_TIMER) Timer register.  Reset Value */

#define SILEX_PK_TIMER_TIMER_Pos              _UINT32_(0)                                          /* (SILEX_PK_TIMER) Number of core clock cycles. Position */
#define SILEX_PK_TIMER_TIMER_Msk              (_UINT32_(0xFFFFFFFF) << SILEX_PK_TIMER_TIMER_Pos)   /* (SILEX_PK_TIMER) Number of core clock cycles. Mask */
#define SILEX_PK_TIMER_TIMER(value)           (SILEX_PK_TIMER_TIMER_Msk & (_UINT32_(value) << SILEX_PK_TIMER_TIMER_Pos)) /* Assigment of value for TIMER in the SILEX_PK_TIMER register */
#define SILEX_PK_TIMER_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (SILEX_PK_TIMER) Register Mask  */


/* -------- SILEX_PK_HWCONFIG : (SILEX Offset: 0x2018) ( R/ 32) Hardware configuration register. -------- */
#define SILEX_PK_HWCONFIG_RESETVALUE          _UINT32_(0x00)                                       /*  (SILEX_PK_HWCONFIG) Hardware configuration register.  Reset Value */

#define SILEX_PK_HWCONFIG_MAXOPSIZE_Pos       _UINT32_(0)                                          /* (SILEX_PK_HWCONFIG) Maximum operand size (number of bytes). Position */
#define SILEX_PK_HWCONFIG_MAXOPSIZE_Msk       (_UINT32_(0xFFF) << SILEX_PK_HWCONFIG_MAXOPSIZE_Pos) /* (SILEX_PK_HWCONFIG) Maximum operand size (number of bytes). Mask */
#define SILEX_PK_HWCONFIG_MAXOPSIZE(value)    (SILEX_PK_HWCONFIG_MAXOPSIZE_Msk & (_UINT32_(value) << SILEX_PK_HWCONFIG_MAXOPSIZE_Pos)) /* Assigment of value for MAXOPSIZE in the SILEX_PK_HWCONFIG register */
#define SILEX_PK_HWCONFIG_NBMULT_Pos          _UINT32_(12)                                         /* (SILEX_PK_HWCONFIG) Number of multipliers: 0x0: 1 multiplier 0x1: 4 multipliers 0x2: 16 multipliers 0x4: 64 multipliers 0x8: 256 multipliers Position */
#define SILEX_PK_HWCONFIG_NBMULT_Msk          (_UINT32_(0xF) << SILEX_PK_HWCONFIG_NBMULT_Pos)      /* (SILEX_PK_HWCONFIG) Number of multipliers: 0x0: 1 multiplier 0x1: 4 multipliers 0x2: 16 multipliers 0x4: 64 multipliers 0x8: 256 multipliers Mask */
#define SILEX_PK_HWCONFIG_NBMULT(value)       (SILEX_PK_HWCONFIG_NBMULT_Msk & (_UINT32_(value) << SILEX_PK_HWCONFIG_NBMULT_Pos)) /* Assigment of value for NBMULT in the SILEX_PK_HWCONFIG register */
#define SILEX_PK_HWCONFIG_PRIMEFIELD_Pos      _UINT32_(16)                                         /* (SILEX_PK_HWCONFIG) Support prime field. Position */
#define SILEX_PK_HWCONFIG_PRIMEFIELD_Msk      (_UINT32_(0x1) << SILEX_PK_HWCONFIG_PRIMEFIELD_Pos)  /* (SILEX_PK_HWCONFIG) Support prime field. Mask */
#define SILEX_PK_HWCONFIG_PRIMEFIELD(value)   (SILEX_PK_HWCONFIG_PRIMEFIELD_Msk & (_UINT32_(value) << SILEX_PK_HWCONFIG_PRIMEFIELD_Pos)) /* Assigment of value for PRIMEFIELD in the SILEX_PK_HWCONFIG register */
#define SILEX_PK_HWCONFIG_BINARYFIELD_Pos     _UINT32_(17)                                         /* (SILEX_PK_HWCONFIG) Support binary field. Position */
#define SILEX_PK_HWCONFIG_BINARYFIELD_Msk     (_UINT32_(0x1) << SILEX_PK_HWCONFIG_BINARYFIELD_Pos) /* (SILEX_PK_HWCONFIG) Support binary field. Mask */
#define SILEX_PK_HWCONFIG_BINARYFIELD(value)  (SILEX_PK_HWCONFIG_BINARYFIELD_Msk & (_UINT32_(value) << SILEX_PK_HWCONFIG_BINARYFIELD_Pos)) /* Assigment of value for BINARYFIELD in the SILEX_PK_HWCONFIG register */
#define SILEX_PK_HWCONFIG_P256_Pos            _UINT32_(20)                                         /* (SILEX_PK_HWCONFIG) Support ECC P256 acceleration. Position */
#define SILEX_PK_HWCONFIG_P256_Msk            (_UINT32_(0x1) << SILEX_PK_HWCONFIG_P256_Pos)        /* (SILEX_PK_HWCONFIG) Support ECC P256 acceleration. Mask */
#define SILEX_PK_HWCONFIG_P256(value)         (SILEX_PK_HWCONFIG_P256_Msk & (_UINT32_(value) << SILEX_PK_HWCONFIG_P256_Pos)) /* Assigment of value for P256 in the SILEX_PK_HWCONFIG register */
#define SILEX_PK_HWCONFIG_P384_Pos            _UINT32_(21)                                         /* (SILEX_PK_HWCONFIG) Support ECC P384 acceleration. Position */
#define SILEX_PK_HWCONFIG_P384_Msk            (_UINT32_(0x1) << SILEX_PK_HWCONFIG_P384_Pos)        /* (SILEX_PK_HWCONFIG) Support ECC P384 acceleration. Mask */
#define SILEX_PK_HWCONFIG_P384(value)         (SILEX_PK_HWCONFIG_P384_Msk & (_UINT32_(value) << SILEX_PK_HWCONFIG_P384_Pos)) /* Assigment of value for P384 in the SILEX_PK_HWCONFIG register */
#define SILEX_PK_HWCONFIG_P521_Pos            _UINT32_(22)                                         /* (SILEX_PK_HWCONFIG) Support ECC P521 acceleration. Position */
#define SILEX_PK_HWCONFIG_P521_Msk            (_UINT32_(0x1) << SILEX_PK_HWCONFIG_P521_Pos)        /* (SILEX_PK_HWCONFIG) Support ECC P521 acceleration. Mask */
#define SILEX_PK_HWCONFIG_P521(value)         (SILEX_PK_HWCONFIG_P521_Msk & (_UINT32_(value) << SILEX_PK_HWCONFIG_P521_Pos)) /* Assigment of value for P521 in the SILEX_PK_HWCONFIG register */
#define SILEX_PK_HWCONFIG_P192_Pos            _UINT32_(23)                                         /* (SILEX_PK_HWCONFIG) Support ECC P192 acceleration. Position */
#define SILEX_PK_HWCONFIG_P192_Msk            (_UINT32_(0x1) << SILEX_PK_HWCONFIG_P192_Pos)        /* (SILEX_PK_HWCONFIG) Support ECC P192 acceleration. Mask */
#define SILEX_PK_HWCONFIG_P192(value)         (SILEX_PK_HWCONFIG_P192_Msk & (_UINT32_(value) << SILEX_PK_HWCONFIG_P192_Pos)) /* Assigment of value for P192 in the SILEX_PK_HWCONFIG register */
#define SILEX_PK_HWCONFIG_X25519_Pos          _UINT32_(24)                                         /* (SILEX_PK_HWCONFIG) Support Curve25519/Ed25519 acceleration. Position */
#define SILEX_PK_HWCONFIG_X25519_Msk          (_UINT32_(0x1) << SILEX_PK_HWCONFIG_X25519_Pos)      /* (SILEX_PK_HWCONFIG) Support Curve25519/Ed25519 acceleration. Mask */
#define SILEX_PK_HWCONFIG_X25519(value)       (SILEX_PK_HWCONFIG_X25519_Msk & (_UINT32_(value) << SILEX_PK_HWCONFIG_X25519_Pos)) /* Assigment of value for X25519 in the SILEX_PK_HWCONFIG register */
#define SILEX_PK_HWCONFIG_AHBMASTER_Pos       _UINT32_(25)                                         /* (SILEX_PK_HWCONFIG) '0': Memory access through AHB Slave and internally in the PKE.                                                                             '1': Memory access through AHB Master, outside the PKE. Position */
#define SILEX_PK_HWCONFIG_AHBMASTER_Msk       (_UINT32_(0x1) << SILEX_PK_HWCONFIG_AHBMASTER_Pos)   /* (SILEX_PK_HWCONFIG) '0': Memory access through AHB Slave and internally in the PKE.                                                                             '1': Memory access through AHB Master, outside the PKE. Mask */
#define SILEX_PK_HWCONFIG_AHBMASTER(value)    (SILEX_PK_HWCONFIG_AHBMASTER_Msk & (_UINT32_(value) << SILEX_PK_HWCONFIG_AHBMASTER_Pos)) /* Assigment of value for AHBMASTER in the SILEX_PK_HWCONFIG register */
#define SILEX_PK_HWCONFIG_DISABLESMX_Pos      _UINT32_(29)                                         /* (SILEX_PK_HWCONFIG) State of DisableSMx input (high when SM2/SM9 operations are disabled). Position */
#define SILEX_PK_HWCONFIG_DISABLESMX_Msk      (_UINT32_(0x1) << SILEX_PK_HWCONFIG_DISABLESMX_Pos)  /* (SILEX_PK_HWCONFIG) State of DisableSMx input (high when SM2/SM9 operations are disabled). Mask */
#define SILEX_PK_HWCONFIG_DISABLESMX(value)   (SILEX_PK_HWCONFIG_DISABLESMX_Msk & (_UINT32_(value) << SILEX_PK_HWCONFIG_DISABLESMX_Pos)) /* Assigment of value for DISABLESMX in the SILEX_PK_HWCONFIG register */
#define SILEX_PK_HWCONFIG_DISABLECLRMEM_Pos   _UINT32_(30)                                         /* (SILEX_PK_HWCONFIG) State of DisableClrMem input (high when automatic clear of the RAM after reset is disabled). Position */
#define SILEX_PK_HWCONFIG_DISABLECLRMEM_Msk   (_UINT32_(0x1) << SILEX_PK_HWCONFIG_DISABLECLRMEM_Pos) /* (SILEX_PK_HWCONFIG) State of DisableClrMem input (high when automatic clear of the RAM after reset is disabled). Mask */
#define SILEX_PK_HWCONFIG_DISABLECLRMEM(value) (SILEX_PK_HWCONFIG_DISABLECLRMEM_Msk & (_UINT32_(value) << SILEX_PK_HWCONFIG_DISABLECLRMEM_Pos)) /* Assigment of value for DISABLECLRMEM in the SILEX_PK_HWCONFIG register */
#define SILEX_PK_HWCONFIG_DISABLECM_Pos       _UINT32_(31)                                         /* (SILEX_PK_HWCONFIG) State of DisableCM input (high when counter-measures are disabled). Position */
#define SILEX_PK_HWCONFIG_DISABLECM_Msk       (_UINT32_(0x1) << SILEX_PK_HWCONFIG_DISABLECM_Pos)   /* (SILEX_PK_HWCONFIG) State of DisableCM input (high when counter-measures are disabled). Mask */
#define SILEX_PK_HWCONFIG_DISABLECM(value)    (SILEX_PK_HWCONFIG_DISABLECM_Msk & (_UINT32_(value) << SILEX_PK_HWCONFIG_DISABLECM_Pos)) /* Assigment of value for DISABLECM in the SILEX_PK_HWCONFIG register */
#define SILEX_PK_HWCONFIG_Msk                 _UINT32_(0xE3F3FFFF)                                 /* (SILEX_PK_HWCONFIG) Register Mask  */

#define SILEX_PK_HWCONFIG_P_Pos               _UINT32_(20)                                         /* (SILEX_PK_HWCONFIG Position) Support ECC P256 acceleration. */
#define SILEX_PK_HWCONFIG_P_Msk               (_UINT32_(0xF) << SILEX_PK_HWCONFIG_P_Pos)           /* (SILEX_PK_HWCONFIG Mask) P */
#define SILEX_PK_HWCONFIG_P(value)            (SILEX_PK_HWCONFIG_P_Msk & (_UINT32_(value) << SILEX_PK_HWCONFIG_P_Pos)) 
#define SILEX_PK_HWCONFIG_X_Pos               _UINT32_(24)                                         /* (SILEX_PK_HWCONFIG Position) Support Curve255x9/Ed255x9 acceleration. */
#define SILEX_PK_HWCONFIG_X_Msk               (_UINT32_(0x1) << SILEX_PK_HWCONFIG_X_Pos)           /* (SILEX_PK_HWCONFIG Mask) X */
#define SILEX_PK_HWCONFIG_X(value)            (SILEX_PK_HWCONFIG_X_Msk & (_UINT32_(value) << SILEX_PK_HWCONFIG_X_Pos)) 

/* -------- SILEX_PK_OPSIZE : (SILEX Offset: 0x201C) (R/W 32) Operand size register. -------- */
#define SILEX_PK_OPSIZE_RESETVALUE            _UINT32_(0x1000)                                     /*  (SILEX_PK_OPSIZE) Operand size register.  Reset Value */

